heroku-high-level.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>(Heroku)</title>
<meta name="author" content="(Its all about the Apps)"/>
<link rel="stylesheet" href="./css/reveal.min.css"/>
<link rel="stylesheet" href="./css/theme/jr0cket.css" id="theme"/>

<link rel="stylesheet" href="./css/print/pdf.css" type="text/css" media="print"/>
<meta name="description" content="Heroku - deploy your apps easily in the Cloud">
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<h1>Heroku</h1>
<h2>Its all about the Apps</h2>
<h2><a href="mailto:@jr0cket">@jr0cket</a></h2>
<h2></h2></section>


<section>
<section id="sec-1" >

<h2>What is Heroku</h2>
<p>
A place to run &amp; scale your apps on the Internet
</p>
</section>
</section>
<section>
<section id="sec-2" >

<h2>Why would I be interested in it</h2>
<ul class="org-ul">
<li class="fragment roll-in">You cant run your apps from your laptop
</li>
<li class="fragment roll-in">You probably dont have funding to hire an operations team
</li>
<li class="fragment roll-in">You do want to focus on building something your customers love
</li>
</ul>
</section>
</section>
<section>
<section id="sec-3" >

<h2>So how can Heroku help</h2>
<p>
Heroku works in the way developers want
</p>
<ul class="org-ul">
<li>providing resources on demand to support your development needs
</li>
<li>using tools developers are familiar with (Git)
</li>
</ul>
</section>
</section>
<section>
<section id="sec-4" >

<h2>Time for a very simple demo</h2>
<ol class="org-ol">
<li class="fragment roll-in">I built an app on my laptop
</li>
<li class="fragment roll-in">Put the code in version control
</li>
<li class="fragment roll-in">Create a space for the app on Heroku
</li>
<li class="fragment roll-in">Deployed the app
</li>
<li class="fragment roll-in">Made some changes to the code
</li>
<li class="fragment roll-in">Deployed a new version of the app
</li>
</ol>
</section>
</section>
<section>
<section id="sec-5" >

<h2>Continuous Deployment</h2>
<p>
Heroku helps you change you app as your business needs it
</p>
<ul class="org-ul">
<li>IT is not the bottleneck
</li>
</ul>
</section>
</section>
<section>
<section id="sec-6" >

<h2>Consistent Environments</h2>
<p>
Your bugs are all your own, not from the environment
</p>
</section>
</section>
<section>
<section id="sec-7" >

<h2>Supports virtually every language</h2>
<p>
Ruby, NodeJS, Java, Python are main supported language
</p>
<ul class="org-ul">
<li>over 50 other languages have been deployed to Heroku
</li>
</ul>
</section>
</section>
<section>
<section id="sec-8" >

<h2>Easy &amp; Fast to Scale</h2>
<p>
If you can use your mouse, you can scale your apps (up &amp; down)
</p>
<ul class="org-ul">
<li>scaling happens almost instantly
</li>
</ul>

<p>
Quickly handle a big spike in customer traffic
</p>
<ul class="org-ul">
<li>avoid loosing customers because of success
</li>
</ul>
</section>

</section>
<section>
<section id="sec-9" >

<h2>Thank you</h2>
<p>
Resources
</p>
<ul class="org-ul">
<li><a href="https://www.heroku.com">www.heroku.com</a>
</li>
</ul>
</section>
</section>
<section>
<section id="sec-10" >

<h2>Intentionally left blank</h2>
</section>
</section>
<section>
<section id="sec-11"  data-background="./images/leiningen-slide-background.png" data-background-transition="slide">

<h2>Slide with background image</h2>

<p>
<a href="http://www.google.co.uk">hyperlink-text</a>
</p>

<ul class="org-ul">
<li class="fragment roll-in">bulletpoint
</li>
<li class="fragment roll-in">dont go crazy
</li>
</ul>

</section>
<section id="sec-11-1" >

<h3>Sub-slide - srolls vertically from slide above</h3>
<p>
Some source code using hightlits.js 
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #FBDE2D;">def</span> <span style="color: #ff1493;">clojure-devs</span> <span style="color: #61CE3C;">"love brackets"</span>)
</pre>
</div>
</section>
</section>
<section>
<section id="sec-12" >

<h2>Slied with code</h2>
<div class="org-src-container">

<pre class="src src-zsh">git init
</pre>
</div>
</section>
</section>
<section>
<section id="sec-13"  data-background="#770000" data-background-transition="slide">

<h2>Slide with Colour - overriding the theme</h2>

<p>
I love red.
</p>

<p class="fragment hightlight-red">
Hightliht text as a fragment of the slide 
</p>



</section>
<section id="sec-13-1" >

<h3>Fragments in Reveal.js</h3>
<p>
Press the "Down" key on the page or the down arrow to trigger fragments
</p>

<ul class="org-ul">
<li class="fragment highlight-blue">Create
</li>
<li class="fragment highlight-blue">Fragment
</li>
<li class="fragment highlight-blue">At Ease
</li>
</ul>
</section>
<section id="sec-13-2" >

<h3>Fragment captions</h3>
<div class="org-src-container">
<label class="org-src-name">The Org text source.</label>
<pre class="src src-org"><span style="color: #8B8989; font-style: italic;">#+ATTR_REVEAL: :frag</span>
   * Create
   * Fragment
   * At Ease
</pre>
</div>
</section>
<section id="sec-13-3"  data-state="alert">

<h3>Reveal.js Can Alert</h3>

<p>
Change slide style to wake up the sleepy audience.
</p>
</section>
</section>
</div>
</div>
<script src="./lib/js/head.min.js"></script>
<script src="./js/reveal.min.js"></script>
<script>

        		// Full list of configuration options available here:
        		// https://github.com/hakimel/reveal.js#configuration
        		Reveal.initialize({
        			controls: true,
        			progress: true,
        			history: true,
        			center: false,
        			rollingLinks: true,
        			keyboard: true,
        			overview: true,
        			width: 1200, // slide width
        			height: 800, // slide height
        			margin: 0.10, // slide margin
        			minScale: 0.50, // slide minimum scaling factor
        			maxScale: 2.50, // slide maximum scaling factor


        			theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
        			transition: Reveal.getQueryHash().transition || 'linear', // default/cube/page/concave/zoom/linear/fade/none
        			transitionSpeed: 'default',

        			// Optional libraries used to extend on reveal.js
        			dependencies: [
        				{ src: './lib/js/classList.js', condition: function() { return !document.body.classList; } }
        				,{ src: './plugin/markdown/showdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } }
        				,{ src: './plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } }
        				,{ src: './plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } }
        				,{ src: './plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } }
        				,{ src: './plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }
        				// { src: './plugin/search/search.js', async: true, condition: function() { return !!document.body.classList; } }
        				// { src: './plugin/remotes/remotes.js', async: true, condition: function() { return !!document.body.classList; } }
         				
        			]
        		});
</script>
</body>
</html>
